{
  "levels": {
    "1": [
      { "id": "q1", "title": "Decrypt the Destination", "body": "You have found this para, your agents found for you, obtain the password and crack the site: **https://79b0a1d2a263.ngrok-free.app** ", "answer": "aibohphobia", "hint": "Each number represents a character's ASCII value. Convert them to letters to form the URL and use your browser's Inspect / View Source to find the hidden flag.", "fileUrl": "timmy.txt" },
      { "id": "q2", "title": "The Ciphered Message", "body": "You are given a **ciphered** code which you will have to decode in order to get the flag.***ZXMQROB IBYOLK***  --> ??", "answer": "capture lebron", "hint": "This is a classic Caesar/ROT substitution. Shift each letter 3 places forward in the alphabet (A → D, B → E, …). Keep spaces as-is." },
      { "id": "q3", "title": "Base Instinct", "body": "Some secrets aren’t meant to be read at first glance. A single line of seemingly random characters hides your next clue. Can you uncover it?\n\n**Challenge:**You stumble upon the following string in a mysterious file:**ZmxhZzpob3BldXJoYXZpbmdmdW4=\n\n*****Task: **Decode* the string to reveal the hidden flag.", "answer": "hopeurhavingfun", "hint": "esab 46" },
      { "id": "q4", "title": "Invisible Ink", "body": "Sometimes secrets are right under your nose. A normal-looking paragraph hides a tiny treasure — only careful eyes will find it.\n\n**Challenge:**Firmware logs always generate: encryption algorithms secure your _ protocol efficiently kernel-side.\n\n**Task:**The flag is hidden in the paragraph. It follows the format: flag:{something}.", "answer": "easy_peks", "hint": "Every word matters — try reading the first letters carefully." },
      { "id": "q5", "title": "Status Report", "body": "Servers speak in *numbers*. Each ***HTTP*** status code below hides a short phrase — read the phrases in order and assemble the secret.\n\n**200 418**\n\n***Task:**** Convert each HTTP status code to its standard reason phrase* Concatenate those phrases in order.* Remove spaces and punctuation (including apostrophes), convert to lowercase.* Prepend flag: and submit.", "answer": "oki'mateapot", "hint": "These numbers aren’t random - they’re HTTP responses. What do 200 and 418 tell you when you visit a website?" },
  { "id": "q6", "title": "Encrypted Time ", "body": "**YITYF DNMTJ RJGY UWXN**\n\n A Beaufort cipher. A clock.\n\n Your clock is special, this clock can be a key but the key cannot be a clock. The key lies etched in time itself. It has the ability to turn you around — quite literally. When time flips, so does meaning.around - quite literally. When time flips, so does meaning.", "answer": "ticktock", "hint": "Time doesn’t always move - sometimes, it spells. Read the hour, minute, and second… Together, they form your key.", "fileUrl": "clock.jpg" },
  { "id": "q7", "title": "Paw Patrol", "body": "You have intercepted a cryptic, almost nonsensical code heading to a secret organisation known only as 'Paw Patrol'.\n\n Alongside the code, a mysterious message is included. It says, 'A word takes a breath. No one breathes in space.' It seems to be a hint of some sort. Use this hint to decode the code. Your fate depends on it.", "answer": "breathe", "hint": "A breath takes a 1 and 0 breathes in space.", "fileUrl": "dog.txt" }
    ],
    "2": [
  { "id": "q8", "title": "Cold Spectrogram", "body": "**Sound** conceals its own shadow.  \n\nWithin this recording a *script* of light lies waiting, not audible, but *visible* if you know how to look.  \n\nFind the flag.", "answer": "code", "hint": "Not all sound is about listening, some are meant to be seen, not heard.", "fileUrl": "soundfile.wav" },
  { "id": "q9", "title": "The Eye Can't See", "body": "*** Nothing is ever truly invisible.***", "answer": "geekout", "hint": "Maybe change up the edits a little bit??", "fileUrl": "porsche.jpg" },
      { "id": "q10", "title": "Silent Syntax", "body": "A Python script runs *perfectly* and prints **meaningless** output. \n\n Running it? Maybe a good idea, maybe a bad one. \n\nLook **inside** - the truth hides where the program does not *bother* to look.", "answer": "aslee", "hint": "This is a placeholder hint for question 10.", "fileUrl": "silent.py" },
      { "id": "q11", "title": "Reversed or Mirrored", "body": "**vhivevI:TZOU .tzou iflb hr vivS !vwlx hrsg wvwlxvw boofuhhvxxfh ve'flb ,hrsg tmrwzvi vi'flb uR !vivsg bvS**\n\n Turn it over and reverse again. \n\n. Will you be able to solve it be left looking in the opposite direction?", "answer": "reverse", "hint": "RORRIM" },
  { "id": "q12", "title": "Encrypted Echo", "body": "Listen up. Follow these instructions without fail. You have been given an encoded message. It looks pretty long, doesn't it? But don't even think of solving it as one block of encrypted text. Do so, and you will lose this challenge AS A WHOLE. Decode the sentences LINE BY LINE. If you don't, well, you've been warned.", "answer": "gotcha!", "hint": "Decode it from hexadecmial to normal text. One by one :)", "fileUrl": "yo.txt" }
    ],
    "3": [
  { "id": "q13", "title": "The Ciphered Coordinates", "body": "You are given a Vigenère ciphered code:***2704 Lshfxl Qal Y4***\n\nYour mission is to decode this message to uncover your next destination.\n\nTo unlock the message, follow the path of green innovation. The architect behind RTX holds the key - six letters, one vision. Hidden within the view lies a cryptic message. \n\nDecoding it will point you toward something nearby — a clue to your final discovery.\n\nA taste of Maharashtra lies nearby - where something sweet, stuffed, and golden might just guide your path.˛Find that spot, and you’ll find your flag.","answer": "puranpoli", "hint": "Your key to this question is Jensen. To the North-East of his place, lies your restaurant." },
  { "id": "q14", "title": "Date in Pixels", "body": "The image looks ordinary at first glance. \n\n But every photograph carries memories - sometimes, even the moment it was taken tells a story. \n\nYou’ve been given this image. Don’t trust what you see on the surface. \n\nLook beyond its colors, beyond its composition. The clue lies in what the picture remembers - not what it shows. \n\nWhen you uncover the date, ask yourself: \n\n**“What in the artistic and abstract world was lost that day?”**", "answer": "kelly", "hint": "Inspect its hidden data, not its pixels. The name you seek worked with colors", "fileUrl": "img.jpg" },
      { "id": "q15", "title": "The Lying Playlist", "body": "**https://tinyurl.com/5aksu7u4** \n\nA playlist has been uploaded. \n\n Every song hides a number, and together they form a story. \n\n Listen carefully. No. Actually look carefully, - titles tell you who, durations tell you when.\n\n Add 11 years to those seconds and you get your flag with the format: {str_int}", "answer": "tesla_1856", "hint": "What’s electric about the name they spell and when did the name come into this world?", "fileUrl": "spotify.png"}
    ]
  },
  "points": { "1": 30, "2": 60, "3": 120 },
  "unlockRules": { "2": {"requireLevel": 1, "requireCount": 3}, "3": {"requireLevel": 2, "requireCount": 2} }
}





